app/views/gadgets/index.html.haml

SELECT `gadgets`.* FROM `gadgets`
SELECT `photos`.* FROM `photos` WHERE `photos`.`gadget_id` = 3 LIMIT 1
---
    %tr
      %td= image_tag gadget.photos.first.gadget_photo.url(:thumb)