app/views/gadgets/my_gadgets.html.haml

    %tr
      %td= image_tag gadget.photos.first.gadget_photo.url(:medium)
---
SELECT `photos`.* FROM `photos` WHERE `photos`.`gadget_id` = 3 LIMIT 1