app/views/gadgets/show.html.haml

SELECT `photos`.* FROM `photos` WHERE `photos`.`gadget_id` = 2
---
  %div.min-height.text-align-center
    - @gadget.photos.reject{|gp| gp.id.nil? }.each do |p|