app/controllers/gadgets_controller.rb

SELECT `gadgets`.* FROM `gadgets`
---
  def index
    @gadgets = Gadget.all

SELECT `gadgets`.* FROM `gadgets`
---
  def iconic_view
    @gadgets = Gadget.all

SELECT `gadgets`.* FROM `gadgets` WHERE `gadgets`.`id` = 1 LIMIT 1
---
  def show
    @gadget = Gadget.find(params[:id])

SELECT `gadgets`.* FROM `gadgets` WHERE `gadgets`.`id` = 3 LIMIT 1
---
  def edit
    @gadget = Gadget.find(params[:id])

INSERT INTO `gadgets` (`created_at`, `name`, `updated_at`, `user_id`) VALUES ('2013-07-04 16:46:19', 'test gadget 1', '2013-07-04 16:46:19', 1)
---
  def create
    @gadget = current_user.gadgets.new(params[:gadget])

    respond_to do |format|
      if @gadget.save

SELECT `gadgets`.* FROM `gadgets` WHERE `gadgets`.`id` = 1 LIMIT 1
DELETE FROM `gadgets` WHERE `gadgets`.`id` = 1
---
  def destroy
    @gadget = Gadget.find(params[:id])
    @gadget.destroy