app/controllers/photos_controller.rb

SELECT `gadgets`.* FROM `gadgets` WHERE `gadgets`.`id` = 1 LIMIT 1
INSERT INTO `photos` (`created_at`, `gadget_id`, `gadget_photo_content_type`, `gadget_photo_file_name`, `gadget_photo_file_size`, `gadget_photo_updated_at`, `updated_at`) VALUES ('2013-07-04 17:53:56', 1, 'image/png', 'bg-cart-women-02.png', 1737, '2013-07-04 17:53:52', '2013-07-04 17:53:56')
---
  def create
    @gadget = Gadget.find(params[:photo][:gadget_id])
    @photos = @gadget.photos.new(params[:photo])
    respond_to do |format|
      if @photos.save